Revit 2023 API
FabricSheet.FabricHostReference Property
 Controls if Single Fabric Sheet should be cut by the Host Cover
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2015
Syntax
C#
public FabricHostReference FabricHostReference { get; set; }
Visual Basic
Public Property FabricHostReference As FabricHostReference
	Get
	Set
Visual C++
public:
property FabricHostReference FabricHostReference {
	FabricHostReference get ();
	void set (FabricHostReference value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace